//------------------------------------------------------------------------------
/// @file
/// @brief    ActionType 列挙型
/// @author   ハル研究所プログラミングコンテスト実行委員会
///
/// @copyright  Copyright (c) 2014 HAL Laboratory, Inc.
/// @attention  このファイルの利用は、同梱のREADMEにある
///             利用条件に従ってください

//------------------------------------------------------------------------------
#pragma once

namespace hpc {

    //------------------------------------------------------------------------------
    /// @brief 一回毎の動作の種類を定義します。
    enum ActionType {
        ActionType_Wait,        ///< 何もしない
        ActionType_Accel,       ///< 加速

        ActionType_TERM
    };
}
//------------------------------------------------------------------------------
// EOF
