//------------------------------------------------------------------------------
/// @file
/// @brief    Answer.cpp の専用インクルードファイル
/// @author   ハル研究所プログラミングコンテスト実行委員会
///
/// @copyright  Copyright (c) 2014 HAL Laboratory, Inc.
/// @attention  このファイルの利用は、同梱のREADMEにある
///             利用条件に従ってください

///
/// 解答ファイル Answer.cpp 専用のインクルードファイルです。
/// Answer.cpp はこのファイルに記述されるファイルのみを
/// インクルードすることができます。
//------------------------------------------------------------------------------
#include "HPCAnswer.hpp"
#include "HPCCollision.hpp"
#include "HPCMath.hpp"

//------------------------------------------------------------------------------
// EOF
