//------------------------------------------------------------------------------
/// @file
/// @brief    CharaType 列挙型
/// @author   ハル研究所プログラミングコンテスト実行委員会
///
/// @copyright  Copyright (c) 2014 HAL Laboratory, Inc.
/// @attention  このファイルの利用は、同梱のREADMEにある
///             利用条件に従ってください

//------------------------------------------------------------------------------
#pragma once

namespace hpc {

    //------------------------------------------------------------------------------
    /// @brief キャラの種類を定義します。
    enum CharaType {
        CharaType_Human,        ///< 人間
        CharaType_Cpu,          ///< CPU

        CharaType_TERM
    };
}
//------------------------------------------------------------------------------
// EOF
