//------------------------------------------------------------------------------
/// @file
/// @brief    HPCParameter.hpp の実装
/// @author   ハル研究所プログラミングコンテスト実行委員会
///
/// @copyright  Copyright (c) 2014 HAL Laboratory, Inc.
/// @attention  このファイルの利用は、同梱のREADMEにある
///             利用条件に従ってください

//------------------------------------------------------------------------------

#include "HPCParameter.hpp"

namespace hpc {
    //------------------------------------------------------------------------------
    float Parameter::CharaAccelSpeed()
    {
        return 0.875f;
    }
    
    //------------------------------------------------------------------------------
    float Parameter::CharaDecelSpeed()
    {
        return 0.0625f;
    }
    
    //------------------------------------------------------------------------------
    float Parameter::CharaRadius()
    {
        return 1.0f;
    }
    
    //------------------------------------------------------------------------------
    float Parameter::CharaReflectionFactor()
    {
        return 0.25f;
    }
    
    //------------------------------------------------------------------------------
    float Parameter::LotusBaseRadius()
    {
        return 0.5f;
    }
}

//------------------------------------------------------------------------------
// EOF
