//------------------------------------------------------------------------------
/// @file
/// @brief    StageState 列挙型
/// @author   ハル研究所プログラミングコンテスト実行委員会
///
/// @copyright  Copyright (c) 2014 HAL Laboratory, Inc.
/// @attention  このファイルの利用は、同梱のREADMEにある
///             利用条件に従ってください

//------------------------------------------------------------------------------
#pragma once

namespace hpc {

    //------------------------------------------------------------------------------
    /// @brief ステージ内での現在の状態を表します。
    enum StageState {
        StageState_Playing,     ///< 進行中
        StageState_Complete,    ///< 完了した
        StageState_Failed,      ///< 最下位になって失敗した
        StageState_TurnLimit,   ///< ターン数の最大値に達した

        StageState_TERM
    };
}
//------------------------------------------------------------------------------
// EOF
