//------------------------------------------------------------------------------
/// @file
/// @brief    ユーザ型の定義
/// @author   ハル研究所プログラミングコンテスト実行委員会
///
/// @copyright  Copyright (c) 2014 HAL Laboratory, Inc.
/// @attention  このファイルの利用は、同梱のREADMEにある
///             利用条件に従ってください

//------------------------------------------------------------------------------
#pragma once

/// 符号なし整数型
typedef unsigned int uint;

//------------------------------------------------------------------------------
// EOF
